[
  {
    "id": 1,
    "title": "Wayfair Wedding Registry",
    "bulletPoints": [
      "Created a subscription-based approach to managing application state using React Context.",
      "Emphasized stability and wrote tests to achieve extensive code coverage.",
      "Led team‘s efforts to improve front-end performance, creating dashboards to monitor web vitals, and reducing our first input delay to under 100ms.",
      "Implemented Storybook for testing UI; trained team in how to use it.",
      "Improved form validation in the create-registry flow."
    ],
    "description": "As the senior front-end engineer, I led our team in decoupling the Registry site from the main Wayfair repo, enabling us to move faster and to create a more stable experience for our users.",
    "image": "/registry.jpg",
    "imageWidth": 1022,
    "imageHeight": 822,
    "altText": "Screenshot of wedding registry site",
    "startDate": 2021,
    "endDate": 2022,
    "buttonText": "View Project"
  },
  {
    "id": 2,
    "title": "“Add to Registry” Button",
    "bulletPoints": [
      "Created a package that can be installed by yarn or npm, and that manages the UI and data requirements for Wayfair’s Add to Registry button.",
      "Led cross-team process to architect an approach that would enable individual buttons to correctly say “Add to Registry” or “View in Registry”, depending on whether they represent products that have already been saved.",
      "Wrote extensive tests, nearing 100% coverage.",
      "Managed data fetching with GraphQL queries that run without the parent application (e.g. the Browse or Product Detail Page page) needing to know anything about them."
    ],
    "description": "I was the lead engineer on our project to create an add-to-registry library that would improve performance, provide a better developer experience, and enable widespread adoption of add-to-registry functionality across Wayfair properties.",
    "image": "/add-to-registry-button.jpg",
    "imageWidth": 1105,
    "imageHeight": 822,
    "altText": "Screenshot of an add-to-registry button",
    "startDate": 2021,
    "url": "https://www.example.com",
    "buttonText": "View Project"
  },
  {
    "id": 3,
    "title": "Favorites/Lists",
    "bulletPoints": [
      "Implemented a complete redesign of the Lists landing page.",
      "Decoupled the save (aka \"heart\") button into a stand-alone library, and simplified the save flow for users with more than one list.",
      "Improved accessibility by enabling keyboard navigation and better support for screen readers.",
      "Implemented bulk editing features for business-to-business users."
    ],
    "description": "The Lists feature drives a disproportionately large segment of Wayfair sales and is consequently a high-profile part of the site. Over approximately two years, I worked on several major projects to improve the Lists experience both on the primary landing page and with the save button.",
    "image": "/favorites.jpg",
    "imageWidth": 1024,
    "imageHeight": 787,
    "altText": "favorites page screenshot",
    "startDate": 2018,
    "endDate": 2020,
    "url": "https://www.example.com",
    "buttonText": "View Project"
  },
  {
    "id": 4,
    "title": "Responsive design for a news platform used by over 160 NPR stations.",
    "bulletPoints": [
      "Researched station and user needs.",
      "Designed and built a responsive Drupal theme adopted by over 160 stations.",
      "Created a flexible yet simple system for handling station branding.",
      "Wrote front-end code for the home page and story pages."
    ],
    "description": "I led user research, designed information architecture, and wrote front end code for Core Publisher, a website publishing platform for small and medium-sized NPR stations.",
    "image": "/core-publisher.png",
    "imageWidth": 2364,
    "imageHeight": 1827,
    "altText": "news website on screens",
    "url": "https://www.example.com",
    "buttonText": "View Project"
  },
  {
    "id": 5,
    "title": "Mobile Web",
    "description": "Before NPR released a responsive news platform for member stations, we created a mobile-only news website.",
    "bulletPoints": [
      "Designed a modified responsive website that was optimized for small screens.",
      "Wrote CSS, jQuery, and PHP for a custom Drupal theme.",
      "Trained team how to use CSS preprocessers and integrated Sass into our front end workflow."
    ],
    "image": "/npr-mobile-web.jpg",
    "imageWidth": 1013,
    "imageHeight": 737,
    "altText": "news website on screens",
    "url": "https://www.example.com",
    "buttonText": "View Project"
  }
]
